words = {"акт", "рай", "юла", "атом", "июль", "слив", "привет", "заезд", "рубль", "слюда", "анализ", "изверг", "сцена", "шелест", "абрикос", "копилка", "указчик", "аквариум", "инфляция", "чудовище", "авторство", "мифология", "черепушка", "антарктика", "обстановка",
         "бег", "рот", "юрк", "арфа", "июнь", "ядро", "смерть", "игрок", "радий", "ситро", "атеист", "левша", "ссылка", "щёголь", "апостол", "ледоруб", "урядник", "аллергия", "конфорка", "шимпанзе", "актёрство", "нашествие", "числитель", "брусничник", "теплообмен",
         "бой", "ром", "явь", "банк", "кедр", "тёща", "адрес", "испуг", "каноэ", "цифра", "баобаб", "истома", "стресс", "щетина", "артикул", "лукошко", "фигурка", "атомоход", "кровосос", "шовинизм", "барахолка", "пакостник", "шлифовщик", "автострада", "фотография",
         "вес", "сын", "ярд", "бокс", "клён", "танк", "амеба", "изъян", "рулет", "цевка", "бурдюк", "изотоп", "туалет", "щебень", "барахло", "мутация", "формула", "акустика", "лампочка", "штукатур", "бриллиант", "паралитик", "шахматист", "бюрократия", "художество",
         "вуз", "сок", "яма", "борщ", "крот", "учёт", "актив", "кирка", "режим", "цокот", "ваниль", "ириска", "триумф", "эбонит", "бульвар", "мазурка", "фюзеляж", "авангард", "литровка", "шабашник", "велосипед", "предгорье", "шампиньон", "бейсболист", "хризантема",
         "бар", "тля", "шах", "бунт", "леди", "утка", "автор", "кочан", "скука", "число", "вампир", "кефаль", "победа", "эпизод", "буханка", "маховик", "философ", "антрацит", "любовник", "щтангист", "военкомат", "резонатор", "шелкопряд", "вакханалия", "христианин",
         "год", "ток", "сон", "вина", "маяк", "фуга", "бугор", "козёл", "самец", "чехол", "глазок", "корпус", "трение", "эффект", "балаган", "меценат", "ханство", "анархист", "медведка", "шарлотка", "геометрия", "рефлексия", "шептаться", "водопровод", "хлеборезка",
         "гол", "уха", "шея", "вето", "мука", "фтор", "бокал", "ларец", "самка", "чужак", "гонять", "листва", "уговор", "эконом", "вдовица", "надежда", "хитрюга", "богатырь", "мельхиор", "щеглёнок", "градусник", "рогоносец", "шоколадка", "гимнастика", "центрифуга",
         "дно", "усы", "фен", "вино", "море", "филе", "ворот", "лейка", "сумка", "чёлка", "герцог", "лавина", "урожай", "эрудит", "габарит", "нападок", "цилиндр", "басурман", "наличник", "щупальца", "дальномер", "символизм", "шутовство", "гравитация", "шизофреник",
         "дом", "уют", "тур", "герб", "мама", "хлор", "выбор", "лиана", "сдвиг", "шарик", "диплом", "медать", "участь", "юбиляр", "гимнаст", "обочина", "цикорий", "величина", "оппонент", "экспонат", "дальтоник", "скворчиха", "шпаргалка", "диетология", "шампанское",
         "дух", "фея", "тыл", "гиря", "мята", "храп", "гость", "лавра", "сенат", "шкура", "дверца", "метраж", "фараон", "юпитер", "генерал", "овчарка", "частник", "владение", "олимпиец", "этикетка", "жаворонок", "скопление", "щиколотка", "душегрейка", "экспертиза",
         "еда", "ход", "суд", "гора", "ночь", "цинк", "гамма", "лимон", "табак", "шпион", "доступ", "молоть", "физика", "сатурн", "гонорар", "окрошка", "чахотка", "газовщик", "половица", "электрик", "жеребёнок", "тиранство", "эвакуация", "ежедневный", "экипировка",
         "ель", "ухо", "сэр", "дева", "неон", "цена", "грива", "мания", "тесто", "штраф", "дерево", "минута", "фрегат", "юбилей", "диагноз", "поминки", "чародей", "гипотеза", "рептилия", "эскадрон", "жаргонизм", "театровед", "экзекутор", "жемчужница", "соглашения",
         "жар", "ход", "сук", "депо", "ожог", "цепь", "гуляш", "мафия", "тунец", "шайба", "домино", "нагрев", "флакон", "юность", "ежевика", "перевал", "шляпник", "губитель", "снеговик", "эмпиризм", "жимолость", "таксопарк", "экземпляр", "жертвовать", "яйцеклетка",
         "жир", "хор", "род", "ёлка", "орда", "цвет", "дюшес", "метан", "театр", "клещи", "еретик", "ноябрь", "хитрец", "южанин", "епископ", "поршень", "штабист", "дерзость", "собрание", "экономия", "злодеяние", "универмаг", "экономика", "жестокость", "содержанка",
         "жук", "цех", "поп", "енот", "олух", "чара", "дрель", "мираж", "тоска", "щегол", "ерунда", "январь", "хоккей", "ювелир", "живодёр", "реклама", "щедрота", "динамика", "трилогия", "смирение", "звёздочка", "утешитель", "экскурсия", "культуризм", "сообщество",
         "зуб", "час", "пир", "ёжик", "прут", "щека", "едкий", "навоз", "убить", "щиток", "ехидна", "напалм", "чудить", "яблоко", "журавль", "ребёнок", "щепотка", "диверсия", "утешение", "эпидемия", "избранник", "фейерверк", "экспонент", "клавиатура", "созерцание",
         "зоб", "чум", "орг", "желе", "пион", "щука", "егерь", "немой", "ущерб", "щенок", "жемчуг", "обойма", "чертёж", "ячейка", "заочник", "рулетка", "щекотка", "действие", "фигурист", "юмореска", "катакомбы", "футболист", "энергетик", "людоедство", "совпадение",
         "имя", "чиж", "нос", "жезл", "плен", "этаж", "еврей", "народ", "уклад", "эпоха", "жадина", "окорок", "чартер", "ищейка", "звякать", "раритет", "экватор", "единорог", "фатализм", "уродство", "килограмм", "финансист", "ювелирный", "легковушка", "самоубийца",
         "кит", "шар", "нюх", "жанр", "роль", "шейх", "ересь", "обрыв", "факел", "экран", "жгутик", "правша", "череда", "эврика", "золушка", "ретушер", "эстрада", "ефрейтор", "характер", "языковед", "коллектив", "хранитель", "юношество", "матриархат", "состязание",
         "муж", "шаг", "лом", "злак", "руда", "шпик", "жизнь", "отвод", "финик", "юрист", "железо", "изжога", "чистка", "эколог", "иллюзия", "секатор", "юморист", "единство", "хлопушка", "газетчик", "корректор", "хронограф", "язычество", "патриархат", "перфоратор",
         "мех", "шоу", "лещ", "заяц", "рама", "эпос", "жабры", "оскал", "угорь", "юноша", "забава", "прибор", "швырок", "уролог", "идеолог", "сержант", "ящерица", "египтяне", "цыплёнок", "геология", "опричнина", "цирюльник", "ясновидец", "марионетка", "подорожник",
         "миф", "щит", "люк", "звон", "рапс", "юмор", "жерло", "палец", "фасад", "ябеда", "зевота", "приказ", "шлюпка", "радист", "кобальт", "трезвон", "ягодник", "жужелица", "чаепитие", "биология", "местность", "церемония", "федерация", "настроение", "монополист",
         "пар", "эра", "лёд", "изба", "серп", "юнга", "загон", "петля", "хилый", "ягуар", "засуха", "рекорд", "ширина", "радуга", "комната", "теплица", "экскурс", "жадность", "черёмуха", "естество", "мыслитель", "цеховщица", "революция", "ностальгия", "миллиардер",
         "хор", "эхо", "луг", "игла", "ярус", "метр", "замок", "покой", "халва", "ягода", "знаток", "развоз", "штатив", "разбой", "колонка", "тромбоз", "элемент", "жёрдочка", "членство", "больница", "махинатор", "циферблат", "разбойник", "отражатель", "металлолом"
         }
def hangman(word):
    wrong = 0
    stages = [" ",
              "_________     ",
              "||      |     ",
              "||      |     ",
              "||      0     ",
              "||     /|\    ",
              "||     / \    ",
              "/\            ",
              ]
    rightletters = list(word)
    board = ["__"] * len(word)
    win = False
    print("Добро пожаловать на казнь!")
    print(" ".join(board))
    while wrong < len(stages) - 1:
        print("\n")
        msg = "Введите букву: "
        guess = input(msg)
        if guess in rightletters:
            cind = rightletters.index(guess)
            board[cind] = guess
            rightletters[cind] = '$'
        else:
            wrong += 1
        print((" ".join(board)))
        e = wrong + 1
        print("\n".join(stages[0: e]))
        if "__" not in board:
            print("Вы выиграли! Было загадано слово: ")
            print(" ".join(board))
            win = True
            break
    if not win:
        print("\n".join(stages[0: wrong + 1]))
        print("Вы проиграли! Было загадано слово: {}.".format(word))
while True:
    a = input("Будете играть с ботом или с человеком? б или ч: ")
    if a == "б":
        try:
            hangman(words.pop())
        except KeyError:
            with open("Congratulations!.txt", "w+") as file:
                file.write("Thank you for playing! You are really win! \n I say goodbye now!")
            print("You win hardcore! Congratulation!")
    elif a == "ч":
        hangman(input("Введите слово для отгадывания: "))
